# keyword로 도서 검색 후 출력(실습)
# web crawling & web Scraping

### HTML, CSS, JavaScript 웹 언어

# W3C
# HTML이 발전발전해서 1999년 4.01버전

# W3C가 1999년 12월에 HTML 4.01을 마지막으로 더 이상 HTML의 버전업은 없다!!! 왜?
# HTML 언어는 기본적으로 2가지 문제점을 가지고 있기 때문에 !
# 1) 정형성이 없다 => 유지보수 시에 문제점이 발생하게 된다.
# 2) 확장성이 없다 => 정해진 tag만 이용해서 사용하다보니 배우고 쓰기는 쉽지만 응용해서 확장하기에는 적합하지 않다.
#
# 2000년부터 w3c는 HTML 표준을 다른 것을 가미해서 위의 2가지 문제를 해결하려 한다.
# XML을 HTML에 도입해서 표준으로 끌고 가려한다.
# XHTML 1.0 이 시작!!!!!!! = > 망. 함. 왜? 프로그래밍 지식이 약한 일반 사용자들이 쓰지 않음.
# XML 사용에 회의적인 시각을 가지고 있는 몇몇 회사들이 컨소시엄을 구성
# XML 대신 HTML을 발전시켜보자 !!=> HTML5
# HTML5의 의의 : 웹페이지 대신 웹 어플리케이션이 대세가 될거다!
# 웹페이지 대신 Front-End Web Application을 사용하게 될것이다!
# => 안드로이드 및 아이폰 앱
# Angular, react.js, view.js => JavaScript
























